<script setup lang="ts">
/*
 * @file     HomeView.vue
 * @menu     메뉴 메인화면 영역
 * @author   astems
 * @since    2026-06-22
 * @version  1.0
 */

// =====================================================================================================
// import 영역
// =====================================================================================================
import { computed, defineAsyncComponent } from 'vue';
import type { Component } from 'vue';
import tokenService from '@/common/service/token';

// =====================================================================================================
// Type 선언 영역
// =====================================================================================================

// =====================================================================================================
// 변수 선언 영역
// =====================================================================================================

const Dashboard01 = defineAsyncComponent(
    () => import('@/components/main/layout/dashboard/Dashboard_01.vue'),
);

const Dashboard02 = defineAsyncComponent(
    () => import('@/components/main/layout/dashboard/Dashboard_02.vue'),
);

const CurrentDashboard = computed<Component>(() => {
    const user = tokenService.getUser();

    return user?.role === '100' ? Dashboard01 : Dashboard02;
});

// =====================================================================================================
// 사용자 정의 함수 영역
// =====================================================================================================

// =====================================================================================================
// Hook 영역
// =====================================================================================================
</script>

<template>
    <component :is="CurrentDashboard" v-if="CurrentDashboard" />
</template>
