/**
 * @file     /api/dashboard.ts
 * @menu     대시보드 관련 api
 * @author   astems
 * @since    2026-06-17
 * @version  1.0
 *
 * @description
 */
// =====================================================================================================
// import 영역
// =====================================================================================================
import api from '@/common/axios/api';

// =====================================================================================================
// Type 선언 영역
// =====================================================================================================
import type { ApiResponse } from '@/types/api';
import type { DashboardProps } from '@/types/dashboard';

// =====================================================================================================
// 변수 선언 영역
// =====================================================================================================
const BASE = '/api/v1/dashboard';

// =====================================================================================================
// 사용자 정의 함수 영역
// =====================================================================================================
// 대시보드 조회
export const selectDashboard01Data = () => {
    return api.get<ApiResponse<DashboardProps>>(`${BASE}/selectDashboard01Data`);
};

// 대시보드 조회
export const selectDashboard02Data = () => {
    return api.get<ApiResponse<DashboardProps>>(`${BASE}/selectDashboard02Data`);
};
